#+TITLE: 工作
#+STARTUP: logdone
#+SEQ_TODO: TODO(t) WAITING(w) | DONE(d) CANCELLED(c)
#+FILETAGS: :work:

每日上班的時候，根據專案的進度指定當天要做的 task 並設定 schedule。

使用 =org-clock-in= 和 =org-clock-out= 追蹤每個 task 所花費的時間。

如果喜歡 [[https://medium.com/@bobchao/%25E7%2595%25AA%25E8%258C%2584%25E5%25B7%25A5%25E4%25BD%259C%25E6%25B3%2595][番茄工作法]] 的話，可以使用 [[https://github.com/lolownia/org-pomodoro][org-pomodoro]] 這套件。

推薦文章: [[https://alberthuang314.blogspot.tw/2012/12/blog-post_12.html][寫實驗紀錄或工作日誌的重要性]]

* 專案 A                                                               :prjA:

** DONE 設計電路
   CLOSED: [2017-08-05 Sat 11:18]
   :LOGBOOK:
   CLOCK: [2017-08-04 Fri 20:18]--[2017-08-05 Sat 20:19] => 24:01
   :END:
** DONE 完成 PCB Layout
   CLOSED: [2017-08-05 Sat 22:00]
   :LOGBOOK:
   CLOCK: [2017-08-05 Sat 20:30]--[2017-08-05 Sat 22:00] =>  1:30
   :END:
** DONE 送洗 PCB Layout
   CLOSED: [2017-08-05 Sat 23:20]
   :LOGBOOK:
   CLOCK: [2017-08-05 Sat 22:30]--[2017-08-05 Sat 23:20] =>  0:50
   :END:
** TODO [#B] 寄信和 Jason 討論 issue #1234
   SCHEDULED: <2017-08-08 Tue>
   :LOGBOOK:
   CLOCK: [2017-08-05 Sat 12:25]--[2017-08-05 Sat 12:25] =>  0:02
   CLOCK: [2017-08-05 Sat 12:25]--[2017-08-05 Sat 12:25] =>  0:01
   :END:

** TODO 解開蟲蟲 #4456 [0/2]
   SCHEDULED: <2017-08-05 Sat>

   - [ ] 找出實際問題
   - [ ] 解決方案
   - [ ] 撰寫 Regression Test

* 專案 B                                                               :prjB:
** TODO [#A] 寄信和 Jason 討論 issue #1235
   SCHEDULED: <2017-08-06 Sun>

** WAITING 等待新的開發板送洗回來
   SCHEDULED: <2017-08-20 Sun>
** TODO [#A] 專案 B 完成教件
   DEADLINE: <2017-09-12 Tue>
* 專案 Y                                                               :prjY:
** DONE 理解 Yocto project 的使用
   CLOSED: [2017-07-04 Tue 12:00]
   :LOGBOOK:
   CLOCK: [2017-07-04 Tue 10:01]--[2017-07-04 Tue 11:50] =>  1:49
   CLOCK: [2017-07-03 Mon 11:01]--[2017-07-03 Mon 11:50] =>  0:49
   CLOCK: [2017-07-03 Mon 09:01]--[2017-07-03 Mon 09:40] =>  0:39
   :END:

** DONE 寫程式 Hello World
   CLOSED: [2017-08-03 Thu 11:12]
   :LOGBOOK:
   CLOCK: [2017-08-03 Thu 09:01]--[2017-08-03 Thu 09:40] =>  0:39
   :END:
** DONE 寫圖形版本的迷宮老鼠
   CLOSED: [2017-08-03 Thu 14:20]
   :LOGBOOK:
   CLOCK: [2017-08-03 Thu 14:01]--[2017-08-03 Thu 14:20] =>  0:19
   CLOCK: [2017-08-03 Thu 13:01]--[2017-08-03 Thu 13:30] =>  0:29
   CLOCK: [2017-08-03 Thu 11:01]--[2017-08-03 Thu 13:00] =>  1:59
   CLOCK: [2017-08-03 Thu 10:35]--[2017-08-03 Thu 10:55] =>  0:20
   CLOCK: [2017-08-03 Thu 10:01]--[2017-08-03 Thu 10:30] =>  0:29
   :END:
** DONE 撰寫教學投影片
   CLOSED: [2017-08-04 Fri 10:15]
   :LOGBOOK:
   CLOCK: [2017-08-04 Fri 09:01]--[2017-08-04 Fri 10:15] =>  1:14
   :END:

* 雜項                                                                 :misc:
** TODO 每日晨會
   SCHEDULED: <2017-08-09 Wed 09:50 +1d>
   :PROPERTIES:
   :LAST_REPEAT: [2017-08-05 Sat 10:03]
   :END:
   - State "CANCELLED"  from "TODO"       [2017-08-05 Sat 10:02]

** TODO 部門內訊
   SCHEDULED: <2017-09-05 Tue 09:50 +1m>
   :PROPERTIES:
   :LAST_REPEAT: [2017-08-05 Sat 07:44]
   :END:
   - State "DONE"       from "TODO"       [2017-08-05 Sat 07:44]